{"id":"h1-data-minimalism","assumption":"More comprehensive multi-modal datasets always improve drug repurposing predictions","hypothesis":"Strategically minimal, high-signal datasets can outperform large, noisy multi-modal approaches for rare diseases","impact":"Could unlock repurposing for ultra-rare conditions with extremely limited data","timestamp":"2025-08-12T22:58:00.000Z","status":"mixed-evidence","literatureEvidence":"SUPPORTING: K-Paths (2025): 90% data reduction with maintained performance; DrugCLIP (2024): Efficient learning without negative sampling; Cortial et al. (2024): Rare diseases inherently have limited data; Carbonari et al. (2025): Focused textual data effective for diagnosis. CHALLENGING: Madrigal (2025): Multimodal integration outperforms single-modal approaches; BioKG Survey (2025): Comprehensive integration improves performance; LLM-DDI (2025): Larger models show better performance trends"}
{"id":"h2-actionability-first","assumption":"Predictive accuracy is the primary success metric for AI drug repurposing systems","hypothesis":"Models optimized for clinical actionability (interpretability, uncertainty quantification, decision support) outperform accuracy-optimized models","impact":"Could bridge the gap between AI predictions and clinical implementation","timestamp":"2025-08-12T22:58:00.000Z","status":"strongly-supported","literatureEvidence":"DrugAgent (2024): Explainable results outperform black-box; K-Paths (2025): Provides interpretable reasoning paths; Hasselgren & Oprea (2023): Technical metrics don't predict clinical success; DrugMCTS (2025): Structured reasoning chains for transparency; Madrigal (2025): Clinical actionability focus; Carbonari et al. (2025): Emphasis on clinical utility over pure accuracy; LLM-DDI (2025): Text-based interpretability advantages"}
{"id":"h3-cross-disease-patterns","assumption":"Each rare disease requires disease-specific computational models and approaches","hypothesis":"Shared mechanistic patterns across rare diseases can be leveraged through transfer learning and meta-learning approaches","impact":"Could enable repurposing for diseases with insufficient individual datasets","timestamp":"2025-08-12T22:58:00.000Z","status":"literature-supported","literatureEvidence":"Carbonari et al. (2025): LLMs identify patterns across rare disease presentations; BioKG Survey (2025): Graph representations capture cross-disease relationships; LLM-DDI (2025): Models capture shared interaction patterns across drug pairs; K-Paths (2025): Multi-hop reasoning enables cross-entity pattern discovery"}
{"id":"h4-parallel-validation","assumption":"Drug validation must follow sequential preclinical → clinical stages","hypothesis":"Parallel, multi-stage validation using real-world evidence can accelerate repurposing timelines without compromising safety","impact":"Could dramatically reduce time-to-treatment for rare disease patients","timestamp":"2025-08-12T22:58:00.000Z","status":"literature-supported","literatureEvidence":"Madrigal (2025): Uses real-world evidence alongside preclinical data for clinical outcome prediction; Cortial et al. (2024): Traditional trials often infeasible for rare conditions, alternative approaches needed; BioKG Survey (2025): Multi-domain integration enables parallel evidence synthesis"}
{"id":"h5-human-ai-collaboration","assumption":"AI should minimize human bias and replace expert judgment in drug repurposing","hypothesis":"Hybrid human-AI systems that amplify rather than replace clinical expertise outperform fully automated approaches","impact":"Could leverage irreplaceable rare disease expertise while scaling discovery","timestamp":"2025-08-12T22:58:00.000Z","status":"strongly-validated","literatureEvidence":"Challa et al. (2021): DIRECT validation - human-AI collaboration outperforms either alone; DrugAgent (2024): Literature verification agent; Hasselgren & Oprea (2023): Human intervention critical for clinical success; DrugMCTS (2025): Multi-agent collaborative reasoning paradigm; Carbonari et al. (2025): LLMs as collaborative diagnostic partners; Madrigal (2025): LLM integration for natural language clinical interaction; BioKG Survey (2025): Interpretable knowledge representation enables human-AI interaction"}