{"id":"drugagent_2024","title":"DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning","authors":"Inoue, Y., Song, T., Fu, T.","journal":"arXiv","year":"2024","doi":"2408.13378","url":"https://arxiv.org/abs/2408.13378","keyAssumptions":"Single-modal approaches sufficient; Black-box models acceptable; Human expertise not needed","keyHypotheses":"Multi-agent framework with explainability outperforms single approaches","strengths":"Interpretable results; Multi-database integration; Literature verification","weaknesses":"Limited clinical validation; Computational complexity","citation":"Inoue, Y., Song, T., & Fu, T. (2024). DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning. arXiv:2408.13378.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Challenges black-box assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"cortial_rare_2024","title":"Artificial intelligence in drug repurposing for rare diseases: a mini-review","authors":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., Blin, O.","journal":"Frontiers in Medicine","year":"2024","doi":"10.3389/fmed.2024.1404338","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11150798/","keyAssumptions":"Rare diseases require new development; Small populations make AI impossible; Traditional trials only valid approach","keyHypotheses":"AI can be adapted for rare disease repurposing despite data limitations","strengths":"Rare disease focus; Systematic review; Clinical perspective","weaknesses":"Limited technical depth; Few concrete examples","citation":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., & Blin, O. (2024). Artificial intelligence in drug repurposing for rare diseases: a mini-review. Frontiers in Medicine, 11, 1404338.","notes":"Validates H1 (data minimalism), H3 (cross-disease patterns), H4 (parallel validation) for rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugclip_2024","title":"DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing","authors":"Lu, Y., Hu, Y., Li, C.","journal":"arXiv","year":"2024","doi":"2407.02265","url":"https://arxiv.org/abs/2407.02265","keyAssumptions":"Negative labels essential; Single-modal sufficient; Traditional supervised learning optimal","keyHypotheses":"Contrastive learning without negative labels improves performance and efficiency","strengths":"No negative sampling needed; Real clinical trial data; Multimodal representation","weaknesses":"Limited evaluation; Dataset size unclear","citation":"Lu, Y., Hu, Y., & Li, C. (2024). DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing. arXiv:2407.02265.","notes":"Supports H1 (data minimalism) and H2 (actionability-first). Challenges accuracy-first assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"challa_human_ai_2021","title":"Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases","authors":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al.","journal":"Frontiers in Genetics","year":"2021","doi":"10.3389/fgene.2021.707836","url":"https://www.frontiersin.org/articles/10.3389/fgene.2021.707836/full","keyAssumptions":"AI should replace human judgment; Computational approaches sufficient; Serendipity cannot be replicated","keyHypotheses":"Human-AI collaboration outperforms either approach alone","strengths":"Strong empirical evidence; Historical analysis; Rare disease focus","weaknesses":"Limited technical detail; Older methodologies","citation":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al. (2021). Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases. Frontiers in Genetics, 12, 707836.","notes":"DIRECTLY validates H5 (human-AI collaboration). Shows expertise irreplaceable in rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"hasselgren_oprea_2023","title":"Artificial Intelligence for Drug Discovery: Are We There Yet?","authors":"Hasselgren, C., Oprea, T.I.","journal":"Annual Review of Pharmacology and Toxicology","year":"2023","doi":"10.1146/annurev-pharmtox-040323-040828","url":"https://arxiv.org/pdf/2307.06521","keyAssumptions":"More AI/data improves outcomes; Technical metrics predict clinical success; AI can replace traditional approaches","keyHypotheses":"AI faces significant validation challenges; Human intervention remains critical","strengths":"Comprehensive review; Critical assessment; Clinical focus","weaknesses":"Limited solutions proposed; Broad scope","citation":"Hasselgren, C., & Oprea, T.I. (2023). Artificial Intelligence for Drug Discovery: Are We There Yet? Annual Review of Pharmacology and Toxicology, 64.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Highlights reproducibility crisis.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"kpaths_2025","title":"K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction","authors":"Abdullahi, T., Gemou, I., Nayak, N.V., et al.","journal":"arXiv","year":"2025","doi":"2502.13344","url":"https://arxiv.org/abs/2502.13344","keyAssumptions":"Subgraph methods optimal; GNNs only viable for KG; LLMs cannot process graphs","keyHypotheses":"Structured path extraction enables both LLMs and GNNs; 90% data reduction possible","strengths":"Novel technical approach; Explainable reasoning; Multi-model compatibility","weaknesses":"Limited clinical validation; Computational requirements unclear","citation":"Abdullahi, T., Gemou, I., Nayak, N.V., et al. (2025). K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction. arXiv:2502.13344.","notes":"Validates H1 (data minimalism) and H2 (actionability-first). Shows 90% data reduction with maintained performance.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugmcts_2025","title":"DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search","authors":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., Song, L.","journal":"arXiv","year":"2025","doi":"2507.07426","url":"https://arxiv.org/abs/2507.07426","keyAssumptions":"Single-agent systems adequate; Simple RAG sufficient; Unstructured search optimal","keyHypotheses":"Multi-agent collaboration with MCTS enables superior structured reasoning for drug repositioning","strengths":"Five specialized agents; MCTS-guided reasoning; Superior recall and robustness","weaknesses":"Computational complexity; Limited clinical validation","citation":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., & Song, L. (2025). DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search. arXiv:2507.07426.","notes":"STRONG validation of H5 (multi-agent collaboration) and H2 (interpretable reasoning). Demonstrates collaborative intelligence outperforming monolithic approaches.","addedDate":"2025-08-13T16:52:00.000Z"}
{"id":"pharmaswarm_2025","title":"LLM Agent Swarm for Hypothesis-Driven Drug Discovery","authors":"Song, K., Trotter, A., Chen, J. Y.","journal":"arXiv","year":"2025","doi":"2504.17967","url":"https://arxiv.org/abs/2504.17967","keyAssumptions":"Single LLMs sufficient; Non-hypothesis-driven approaches adequate; Static models acceptable","keyHypotheses":"Multi-agent swarm with hypothesis-driven workflows and self-improvement outperforms traditional pipelines","strengths":"Specialized agents; Central evaluator; Four-tier validation; Self-improving system","weaknesses":"Computational requirements; Deployment complexity","citation":"Song, K., Trotter, A., & Chen, J. Y. (2025). LLM Agent Swarm for Hypothesis-Driven Drug Discovery. arXiv:2504.17967.","notes":"EXCEPTIONAL support for H2 (actionability-first) and H5 (human-AI collaboration). Explicit AI copilot design with biological plausibility ranking.","addedDate":"2025-08-13T16:52:00.000Z"}
{"id":"dfdrnn_2024","title":"DFDRNN: A dual-feature based neural network for drug repositioning","authors":"Zhu, E., Li, X., Liu, C., Pal, N. R.","journal":"arXiv","year":"2024","doi":"2407.11812","url":"https://arxiv.org/abs/2407.11812","keyAssumptions":"Neighbor-based features sufficient; Single-domain learning adequate; Simple architectures optimal","keyHypotheses":"Dual-feature representation with cross-domain learning enables superior drug-disease predictions","strengths":"Self-attention mechanism; Dual-feature design; AUROC 0.946; Outperforms 6 baselines","weaknesses":"Limited interpretability details; Clinical validation needed","citation":"Zhu, E., Li, X., Liu, C., & Pal, N. R. (2024). DFDRNN: A dual-feature based neural network for drug repositioning. arXiv:2407.11812.","notes":"Supports H2 (actionability through attention) and H3 (cross-disease patterns). Demonstrates sophisticated architecture benefits.","addedDate":"2025-08-13T16:52:00.000Z"}
{"id":"drugrealign_2024","title":"DrugReAlign: a multisource prompt framework for drug repurposing based on large language models","authors":"Wei, J., Zhuo, L., Fu, X., Zeng, X., Wang, L., Zou, Q.","journal":"BMC Biology","year":"2024","doi":"10.1186/s12915-024-02028-3","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11463036/","keyAssumptions":"Single-source approaches sufficient; Manual expert analysis optimal; Traditional ML adequate for biomedical text","keyHypotheses":"Multisource LLM framework with sophisticated prompting outperforms traditional approaches","strengths":"Multisource integration; Prompt engineering; Peer-reviewed publication; Clinical relevance focus","weaknesses":"LLM computational requirements; Prompt engineering complexity","citation":"Wei, J., Zhuo, L., Fu, X., Zeng, X., Wang, L., & Zou, Q. (2024). DrugReAlign: a multisource prompt framework for drug repurposing based on large language models. BMC Biology, 22, 226.","notes":"Strong support for H5 (human knowledge augmentation) and H2 (clinical actionability). Establishes LLMs as viable drug repurposing approach.","addedDate":"2025-08-13T16:52:00.000Z"}
{"id":"rare_disease_llm_2025","title":"Decoding Rarity: Large Language Models in the Diagnosis of Rare Diseases","authors":"Carbonari, V., Veltri, P., Guzzi, P. H.","journal":"arXiv","year":"2025","doi":"2505.17065","url":"https://arxiv.org/abs/2505.17065","keyAssumptions":"Traditional ML sufficient for rare diseases; Single-modal data adequate; Generic AI models sufficient","keyHypotheses":"LLMs can transform rare disease research through textual analysis and conversational interfaces","strengths":"Multi-LLM evaluation; Rare disease focus; Conversational interfaces; Multimodal vision","weaknesses":"Limited experimental validation; Text-only current focus","citation":"Carbonari, V., Veltri, P., & Guzzi, P. H. (2025). Decoding Rarity: Large Language Models in the Diagnosis of Rare Diseases. arXiv:2505.17065.","notes":"Validates H1 (data minimalism for rare diseases), H2 (actionability focus), H5 (human-AI collaboration). Rare diseases as natural validation ground.","addedDate":"2025-08-13T16:52:00.000Z"}