{"id":"cortial2024","title":"Artificial intelligence in drug repurposing for rare diseases: a mini-review","authors":"Lucas Cortial, Vincent Montero, Sébastien Tourlet, Joanie Del Bano, Olivier Blin","journal":"Front Med (Lausanne)","year":"2024","doi":"10.3389/fmed.2024.1404338","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11150798/","keyAssumptions":"AI approaches can be directly transferred to rare disease contexts; traditional drug development pipelines apply to rare diseases; data maximalism improves outcomes","keyHypotheses":"AI-driven repurposing is particularly suited for rare diseases due to existing safety/efficacy data; cross-disease pattern learning can identify shared mechanisms","strengths":"Rare disease-specific focus; systematic review methodology; clinical translation emphasis","weaknesses":"Limited technical detail; assumes data maximalism; lacks actionability framework","citation":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., & Blin, O. (2024). Artificial intelligence in drug repurposing for rare diseases: a mini-review. Frontiers in Medicine, 11, 1404338.","notes":"Key foundational paper establishing AI for rare disease repurposing. Supports our data minimalism and actionability hypotheses by highlighting current limitations.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"challa2021","title":"Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases","authors":"Anup P. Challa, Nicole M. Zaleski, Rebecca N. Jerome, Robert R. Lavieri, Jana K. Shirey-Rice, April Barnado, Christopher J. Lindsell, David M. Aronoff, Leslie J. Crofford, Raymond C. Harris, T. Alp Ikizler, Ingrid A. Mayer, Kenneth J. Holroyd, Jill M. Pulley","journal":"Front. Genet.","year":"2021","doi":"10.3389/fgene.2021.707836","url":"https://www.frontiersin.org/articles/10.3389/fgene.2021.707836/full","keyAssumptions":"AI should replace human decision-making to eliminate bias; automated approaches are superior to human-guided systems","keyHypotheses":"Human-AI collaboration outperforms fully automated approaches; hybrid systems combine pattern recognition with clinical context","strengths":"Empirical evidence for human-AI collaboration; Vanderbilt case studies; clinical validation focus","weaknesses":"Limited technical implementation details; single institution experience","citation":"Challa, A. P., Zaleski, N. M., Jerome, R. N., Lavieri, R. R., Shirey-Rice, J. K., Barnado, A., ... & Pulley, J. M. (2021). Human and machine intelligence together drive drug repurposing in rare diseases. Frontiers in Genetics, 12, 707836.","notes":"Critical evidence supporting Hypothesis 5 (Human-AI Collaboration). Demonstrates superiority of collaborative intelligence over automated approaches.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"zhong2023","title":"Knowledge-augmented Graph Machine Learning for Drug Discovery: A Survey","authors":"Zhiqiang Zhong, Anastasia Barkova, Davide Mottin","journal":"arXiv preprint","year":"2023","doi":"arXiv:2302.08261","url":"https://arxiv.org/html/2302.08261v3","keyAssumptions":"Graph neural networks alone sufficient for biomedical prediction; more data always improves performance; accuracy is primary success metric","keyHypotheses":"Knowledge integration improves both accuracy and interpretability; systematic knowledge augmentation outperforms data-only approaches","strengths":"Comprehensive technical framework; systematic taxonomy; performance improvements (7-8% gains); interpretability focus","weaknesses":"Limited rare disease focus; computational overhead concerns","citation":"Zhong, Z., Barkova, A., & Mottin, D. (2023). Knowledge-augmented Graph Machine Learning for Drug Discovery: A Survey from Precision to Interpretability. arXiv preprint arXiv:2302.08261.","notes":"Technical foundation for knowledge-augmented approaches. Supports actionability-first design and cross-disease learning hypotheses.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"pan2022","title":"Deep learning for drug repurposing: methods, databases, and applications","authors":"Xiaoqin Pan, Xuan Lin, Dongsheng Cao, Xiangxiang Zeng, Philip S. Yu, Lifang He, Ruth Nussinov, Feixiong Cheng","journal":"arXiv preprint","year":"2022","doi":"arXiv:2202.05145","url":"https://arxiv.org/pdf/2202.05145.pdf","keyAssumptions":"Comprehensive multi-modal datasets always improve performance; accuracy is primary success metric; traditional validation sequences required","keyHypotheses":"Deep multi-modal integration achieves superior performance; end-to-end learning pipelines optimize drug repurposing","strengths":"Comprehensive technical survey; strong performance results (15% improvement); multi-modal integration; COVID-19 validation","weaknesses":"Data maximalism bias; limited clinical actionability focus; accuracy-first optimization","citation":"Pan, X., Lin, X., Cao, D., Zeng, X., Yu, P. S., He, L., ... & Cheng, F. (2022). Deep learning for drug repurposing: methods, databases, and applications. arXiv preprint arXiv:2202.05145.","notes":"Comprehensive deep learning survey. Demonstrates performance gains but highlights clinical translation gap. Supports need for actionability-first design.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"manicavasagam2022","title":"Drug Repurposing for Rare Orphan Diseases Using Machine Learning Techniques","authors":"Rajesh Manicavasaga, Prabin B Lamichhane, Prajjwal Kandel, Douglas A. Talbert","journal":"FLAIRS","year":"2022","doi":"https://journals.flvc.org/FLAIRS/article/download/130653/133911","url":"https://journals.flvc.org/FLAIRS/article/download/130653/133911","keyAssumptions":"Traditional ML sufficient for rare disease applications; each disease requires separate models","keyHypotheses":"ML can identify similar drugs for similar diseases; drug-drug and drug-target interactions predict repurposing potential","strengths":"Rare disease focus; practical implementation approach","weaknesses":"Limited technical sophistication; traditional ML only; small scale validation","citation":"Manicavasagam, R., Lamichhane, P. B., Kandel, P., & Talbert, D. A. (2022). Drug Repurposing for Rare Orphan Diseases Using Machine Learning Techniques. FLAIRS.","notes":"Practical ML application to rare diseases. Demonstrates limitations of traditional approaches and need for advanced methods.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"inoue2023","title":"Explainable Drug Repurposing Agent with Large Language Model-based Reasoning","authors":"Yoshitaka Inoue, Tianci Song, Tianfan Fu","journal":"arXiv preprint","year":"2023","doi":"arXiv:2408.13378","url":"https://arxiv.org/html/2408.13378v3","keyAssumptions":"Single AI agents sufficient for drug repurposing; black-box predictions acceptable for clinical use","keyHypotheses":"Multi-agent frameworks with LLM reasoning improve interpretability; explainable AI enables better clinical translation","strengths":"Multi-agent architecture; explainability focus; LLM integration; interpretable results","weaknesses":"Limited rare disease focus; computational complexity","citation":"Inoue, Y., Song, T., & Fu, T. (2023). DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning. arXiv preprint arXiv:2408.13378.","notes":"Novel multi-agent approach with explainability. Supports actionability-first design and human-AI collaboration hypotheses.","addedDate":"2025-08-12T23:05:00.000Z"}
{"id":"jonker2024","title":"Drug repurposing for rare: progress and opportunities for the rare disease community","authors":"Anneliene Hechtelt Jonker, Daniel O'Connor, Maria Cavaller-Bellaubi, Christine Fetro, Maria Gogou, Peter A. C. 'T Hoen, Martin de Kort, Heather Stone, Nivedita Valentine, Anna Maria Gerdina Pasmooij","journal":"Front Med","year":"2024","doi":"10.3389/fmed.2024.1352803","url":"https://www.frontiersin.org/journals/medicine/articles/10.3389/fmed.2024.1352803/full","keyAssumptions":"Traditional development pathways apply to rare diseases; sequential validation required","keyHypotheses":"Drug repurposing particularly valuable for rare diseases; collaborative approaches accelerate development","strengths":"IRDiRC guidelines; regulatory focus; collaborative framework; practical implementation guidance","weaknesses":"Limited AI/ML focus; traditional regulatory approach","citation":"Jonker, A. H., O'Connor, D., Cavaller-Bellaubi, M., Fetro, C., Gogou, M., 'T Hoen, P. A. C., ... & Pasmooij, A. M. G. (2024). Drug repurposing for rare: progress and opportunities for the rare disease community. Frontiers in Medicine, 11, 1352803.","notes":"IRDiRC perspective on rare disease repurposing. Supports parallel validation hypothesis and collaborative approaches.","addedDate":"2025-08-12T23:05:00.000Z"}