{"id":"drugagent_2024","title":"DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning","authors":"Inoue, Y., Song, T., Fu, T.","journal":"arXiv","year":"2024","doi":"2408.13378","url":"https://arxiv.org/abs/2408.13378","keyAssumptions":"Single-modal approaches sufficient; Black-box models acceptable; Human expertise not needed","keyHypotheses":"Multi-agent framework with explainability outperforms single approaches","strengths":"Interpretable results; Multi-database integration; Literature verification","weaknesses":"Limited clinical validation; Computational complexity","citation":"Inoue, Y., Song, T., & Fu, T. (2024). DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning. arXiv:2408.13378.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Challenges black-box assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"cortial_rare_2024","title":"Artificial intelligence in drug repurposing for rare diseases: a mini-review","authors":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., Blin, O.","journal":"Frontiers in Medicine","year":"2024","doi":"10.3389/fmed.2024.1404338","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11150798/","keyAssumptions":"Rare diseases require new development; Small populations make AI impossible; Traditional trials only valid approach","keyHypotheses":"AI can be adapted for rare disease repurposing despite data limitations","strengths":"Rare disease focus; Systematic review; Clinical perspective","weaknesses":"Limited technical depth; Few concrete examples","citation":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., & Blin, O. (2024). Artificial intelligence in drug repurposing for rare diseases: a mini-review. Frontiers in Medicine, 11, 1404338.","notes":"Validates H1 (data minimalism), H3 (cross-disease patterns), H4 (parallel validation) for rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugclip_2024","title":"DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing","authors":"Lu, Y., Hu, Y., Li, C.","journal":"arXiv","year":"2024","doi":"2407.02265","url":"https://arxiv.org/abs/2407.02265","keyAssumptions":"Negative labels essential; Single-modal sufficient; Traditional supervised learning optimal","keyHypotheses":"Contrastive learning without negative labels improves performance and efficiency","strengths":"No negative sampling needed; Real clinical trial data; Multimodal representation","weaknesses":"Limited evaluation; Dataset size unclear","citation":"Lu, Y., Hu, Y., & Li, C. (2024). DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing. arXiv:2407.02265.","notes":"Supports H1 (data minimalism) and H2 (actionability-first). Challenges accuracy-first assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"challa_human_ai_2021","title":"Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases","authors":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al.","journal":"Frontiers in Genetics","year":"2021","doi":"10.3389/fgene.2021.707836","url":"https://www.frontiersin.org/articles/10.3389/fgene.2021.707836/full","keyAssumptions":"AI should replace human judgment; Computational approaches sufficient; Serendipity cannot be replicated","keyHypotheses":"Human-AI collaboration outperforms either approach alone","strengths":"Strong empirical evidence; Historical analysis; Rare disease focus","weaknesses":"Limited technical detail; Older methodologies","citation":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al. (2021). Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases. Frontiers in Genetics, 12, 707836.","notes":"DIRECTLY validates H5 (human-AI collaboration). Shows expertise irreplaceable in rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"hasselgren_oprea_2023","title":"Artificial Intelligence for Drug Discovery: Are We There Yet?","authors":"Hasselgren, C., Oprea, T.I.","journal":"Annual Review of Pharmacology and Toxicology","year":"2023","doi":"10.1146/annurev-pharmtox-040323-040828","url":"https://arxiv.org/pdf/2307.06521","keyAssumptions":"More AI/data improves outcomes; Technical metrics predict clinical success; AI can replace traditional approaches","keyHypotheses":"AI faces significant validation challenges; Human intervention remains critical","strengths":"Comprehensive review; Critical assessment; Clinical focus","weaknesses":"Limited solutions proposed; Broad scope","citation":"Hasselgren, C., & Oprea, T.I. (2023). Artificial Intelligence for Drug Discovery: Are We There Yet? Annual Review of Pharmacology and Toxicology, 64.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Highlights reproducibility crisis.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"kpaths_2025","title":"K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction","authors":"Abdullahi, T., Gemou, I., Nayak, N.V., et al.","journal":"arXiv","year":"2025","doi":"2502.13344","url":"https://arxiv.org/abs/2502.13344","keyAssumptions":"Subgraph methods optimal; GNNs only viable for KG; LLMs cannot process graphs","keyHypotheses":"Structured path extraction enables both LLMs and GNNs; 90% data reduction possible","strengths":"Novel technical approach; Explainable reasoning; Multi-model compatibility","weaknesses":"Limited clinical validation; Computational requirements unclear","citation":"Abdullahi, T., Gemou, I., Nayak, N.V., et al. (2025). K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction. arXiv:2502.13344.","notes":"Validates H1 (data minimalism) and H2 (actionability-first). Shows 90% data reduction with maintained performance.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugmcts_2025","title":"DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search","authors":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., Song, L.","journal":"arXiv","year":"2025","doi":"2507.07426","url":"https://arxiv.org/abs/2507.07426","keyAssumptions":"Linear reasoning sufficient; Single-agent approaches adequate; Unstructured search optimal","keyHypotheses":"MCTS + multi-agent + RAG enables systematic iterative reasoning for drug repurposing","strengths":"Novel architecture integration; Systematic reasoning; Superior recall and robustness","weaknesses":"Computational complexity; Limited clinical validation; Rare disease evaluation unclear","citation":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., & Song, L. (2025). DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search. arXiv:2507.07426.","notes":"Validates H2 (actionability-first) and H4 (parallel validation). First MCTS integration for drug repurposing.","addedDate":"2025-08-13T05:07:00.000Z"}
{"id":"rareagents_2024","title":"RareAgents: Advancing Rare Disease Care through LLM-Empowered Multi-disciplinary Team","authors":"Chen, X., Jin, Y., Mao, X., Wang, L., Zhang, S., Chen, T.","journal":"arXiv","year":"2024","doi":"2412.12475","url":"https://arxiv.org/abs/2412.12475","keyAssumptions":"General medical AI handles rare diseases; Single-agent sufficient; Common disease optimization adequate","keyHypotheses":"Specialized multi-disciplinary LLM team outperforms general approaches for rare diseases","strengths":"First rare disease-specific framework; MDT coordination; Superior performance; Novel dataset","weaknesses":"Computational requirements; Scalability questions; Limited clinical deployment","citation":"Chen, X., Jin, Y., Mao, X., Wang, L., Zhang, S., & Chen, T. (2024). RareAgents: Advancing Rare Disease Care through LLM-Empowered Multi-disciplinary Team. arXiv:2412.12475.","notes":"DIRECT validation of H2 (actionability-first), H4 (parallel validation), H5 (human-AI collaboration). Landmark rare disease contribution.","addedDate":"2025-08-13T05:07:00.000Z"}
{"id":"txgnn_2024","title":"A foundation model for clinician-centered drug repurposing","authors":"Huang, K., Chandak, P., Wang, Q., Havaldar, S., Vaid, A., Leskovec, J., Nadkarni, G., Glicksberg, B.S., Gehlenborg, N., Zitnik, M.","journal":"Nature Medicine","year":"2024","doi":"10.1038/s41591-024-03233-x","url":"https://www.nature.com/articles/s41591-024-03233-x","keyAssumptions":"Supervised learning with extensive labels necessary; Disease-specific models required; Complete molecular understanding prerequisite","keyHypotheses":"Zero-shot foundation model can handle 17,000+ diseases without fine-tuning","strengths":"Unprecedented scale; Clinical validation; Zero-shot capability; Open-source availability; Expert-tested interface","weaknesses":"Computational requirements; Knowledge graph dependence; Clinical trial gap","citation":"Huang, K., Chandak, P., Wang, Q., et al. (2024). A foundation model for clinician-centered drug repurposing. Nature Medicine.","notes":"MULTIPLE DIRECT VALIDATIONS: H1 (data minimalism), H2 (actionability-first), H3 (cross-disease patterns), H5 (human-AI collaboration). Groundbreaking clinical impact.","addedDate":"2025-08-13T05:07:00.000Z"}