{"id":"drugagent_2024","title":"DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning","authors":"Inoue, Y., Song, T., Fu, T.","journal":"arXiv","year":"2024","doi":"2408.13378","url":"https://arxiv.org/abs/2408.13378","keyAssumptions":"Single-modal approaches sufficient; Black-box models acceptable; Human expertise not needed","keyHypotheses":"Multi-agent framework with explainability outperforms single approaches","strengths":"Interpretable results; Multi-database integration; Literature verification","weaknesses":"Limited clinical validation; Computational complexity","citation":"Inoue, Y., Song, T., & Fu, T. (2024). DrugAgent: Explainable Drug Repurposing Agent with Large Language Model-based Reasoning. arXiv:2408.13378.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Challenges black-box assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"cortial_rare_2024","title":"Artificial intelligence in drug repurposing for rare diseases: a mini-review","authors":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., Blin, O.","journal":"Frontiers in Medicine","year":"2024","doi":"10.3389/fmed.2024.1404338","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11150798/","keyAssumptions":"Rare diseases require new development; Small populations make AI impossible; Traditional trials only valid approach","keyHypotheses":"AI can be adapted for rare disease repurposing despite data limitations","strengths":"Rare disease focus; Systematic review; Clinical perspective","weaknesses":"Limited technical depth; Few concrete examples","citation":"Cortial, L., Montero, V., Tourlet, S., Del Bano, J., & Blin, O. (2024). Artificial intelligence in drug repurposing for rare diseases: a mini-review. Frontiers in Medicine, 11, 1404338.","notes":"Validates H1 (data minimalism), H3 (cross-disease patterns), H4 (parallel validation) for rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugclip_2024","title":"DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing","authors":"Lu, Y., Hu, Y., Li, C.","journal":"arXiv","year":"2024","doi":"2407.02265","url":"https://arxiv.org/abs/2407.02265","keyAssumptions":"Negative labels essential; Single-modal sufficient; Traditional supervised learning optimal","keyHypotheses":"Contrastive learning without negative labels improves performance and efficiency","strengths":"No negative sampling needed; Real clinical trial data; Multimodal representation","weaknesses":"Limited evaluation; Dataset size unclear","citation":"Lu, Y., Hu, Y., & Li, C. (2024). DrugCLIP: Contrastive Drug-Disease Interaction For Drug Repurposing. arXiv:2407.02265.","notes":"Supports H1 (data minimalism) and H2 (actionability-first). Challenges accuracy-first assumption.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"challa_human_ai_2021","title":"Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases","authors":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al.","journal":"Frontiers in Genetics","year":"2021","doi":"10.3389/fgene.2021.707836","url":"https://www.frontiersin.org/articles/10.3389/fgene.2021.707836/full","keyAssumptions":"AI should replace human judgment; Computational approaches sufficient; Serendipity cannot be replicated","keyHypotheses":"Human-AI collaboration outperforms either approach alone","strengths":"Strong empirical evidence; Historical analysis; Rare disease focus","weaknesses":"Limited technical detail; Older methodologies","citation":"Challa, A.P., Zaleski, N.M., Jerome, R.N., et al. (2021). Human and Machine Intelligence Together Drive Drug Repurposing in Rare Diseases. Frontiers in Genetics, 12, 707836.","notes":"DIRECTLY validates H5 (human-AI collaboration). Shows expertise irreplaceable in rare diseases.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"hasselgren_oprea_2023","title":"Artificial Intelligence for Drug Discovery: Are We There Yet?","authors":"Hasselgren, C., Oprea, T.I.","journal":"Annual Review of Pharmacology and Toxicology","year":"2023","doi":"10.1146/annurev-pharmtox-040323-040828","url":"https://arxiv.org/pdf/2307.06521","keyAssumptions":"More AI/data improves outcomes; Technical metrics predict clinical success; AI can replace traditional approaches","keyHypotheses":"AI faces significant validation challenges; Human intervention remains critical","strengths":"Comprehensive review; Critical assessment; Clinical focus","weaknesses":"Limited solutions proposed; Broad scope","citation":"Hasselgren, C., & Oprea, T.I. (2023). Artificial Intelligence for Drug Discovery: Are We There Yet? Annual Review of Pharmacology and Toxicology, 64.","notes":"Supports H2 (actionability-first) and H5 (human-AI collaboration). Highlights reproducibility crisis.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"kpaths_2025","title":"K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction","authors":"Abdullahi, T., Gemou, I., Nayak, N.V., et al.","journal":"arXiv","year":"2025","doi":"2502.13344","url":"https://arxiv.org/abs/2502.13344","keyAssumptions":"Subgraph methods optimal; GNNs only viable for KG; LLMs cannot process graphs","keyHypotheses":"Structured path extraction enables both LLMs and GNNs; 90% data reduction possible","strengths":"Novel technical approach; Explainable reasoning; Multi-model compatibility","weaknesses":"Limited clinical validation; Computational requirements unclear","citation":"Abdullahi, T., Gemou, I., Nayak, N.V., et al. (2025). K-Paths: Reasoning over Graph Paths for Drug Repurposing and Drug Interaction Prediction. arXiv:2502.13344.","notes":"Validates H1 (data minimalism) and H2 (actionability-first). Shows 90% data reduction with maintained performance.","addedDate":"2025-08-12T23:15:00.000Z"}
{"id":"drugmcts_2025","title":"DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search","authors":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., Song, L.","journal":"arXiv","year":"2025","doi":"2507.07426","url":"https://arxiv.org/abs/2507.07426","keyAssumptions":"Fine-tuning required for domain adaptation; Simple RAG sufficient; Single-agent approaches adequate","keyHypotheses":"Multi-agent + MCTS enables structured reasoning; RAG can be enhanced through agent collaboration","strengths":"Novel multi-agent architecture; MCTS integration; Superior performance on DrugBank/KIBA","weaknesses":"Computational complexity; Limited to specific datasets","citation":"Yang, Z., Wan, Y., Yan, S., Matsuda, Y., Xie, T., Hoex, B., & Song, L. (2025). DrugMCTS: a drug repurposing framework combining multi-agent, RAG and Monte Carlo Tree Search. arXiv:2507.07426.","notes":"Supports H5 (collaborative intelligence), H2 (actionability through interpretable reasoning), H1 (structured reasoning over massive data).","addedDate":"2025-08-13T05:26:00.000Z"}
{"id":"llm_rare_diagnosis_2025","title":"Decoding Rarity: Large Language Models in the Diagnosis of Rare Diseases","authors":"Carbonari, V., Veltri, P., Guzzi, P.H.","journal":"arXiv","year":"2025","doi":"2505.17065","url":"https://arxiv.org/abs/2505.17065","keyAssumptions":"Single-modality textual data sufficient; Expert-only diagnosis; Static medical knowledge","keyHypotheses":"LLMs can democratize rare disease expertise; Conversational interfaces improve diagnostic access","strengths":"Comprehensive LLM survey; Clinical focus; Multimodal future framework","weaknesses":"Limited real-world validation; Privacy/ethical concerns","citation":"Carbonari, V., Veltri, P., & Guzzi, P.H. (2025). Decoding Rarity: Large Language Models in the Diagnosis of Rare Diseases. arXiv:2505.17065.","notes":"Strongly supports H5 (human-AI collaboration), H1 (focused textual data), H2 (clinical actionability), H3 (cross-disease patterns).","addedDate":"2025-08-13T05:26:00.000Z"}
{"id":"madrigal_multimodal_2025","title":"Multimodal AI predicts clinical outcomes of drug combinations from preclinical data","authors":"Huang, Y., Su, X., Ullanat, V., et al.","journal":"arXiv","year":"2025","doi":"2503.02781","url":"https://arxiv.org/abs/2503.02781","keyAssumptions":"Single-modality sufficient; Data completeness required; Accuracy-first metrics; Monolithic modeling","keyHypotheses":"Multimodal integration with missing data handling bridges preclinical-clinical gap","strengths":"Comprehensive multimodal approach; Clinical validation; Missing data robustness; LLM integration","weaknesses":"Computational requirements; Limited rare disease focus","citation":"Huang, Y., Su, X., Ullanat, V., et al. (2025). Multimodal AI predicts clinical outcomes of drug combinations from preclinical data. arXiv:2503.02781.","notes":"Strongly supports H2 (actionability-first), challenges H1 (data minimalism), supports H4 (parallel validation), H5 (human-AI via LLM).","addedDate":"2025-08-13T05:26:00.000Z"}
{"id":"llm_ddi_2025","title":"LLMs for Drug-Drug Interaction Prediction: A Comprehensive Comparison","authors":"De Vito, G., Ferrucci, F., Angelakis, A.","journal":"arXiv","year":"2025","doi":"2502.06890","url":"https://arxiv.org/abs/2502.06890","keyAssumptions":"Structured molecular representations required; Domain-specific models necessary; Feature engineering essential","keyHypotheses":"LLMs can process molecular data as text; Fine-tuned smaller models can outperform large zero-shot models","strengths":"Comprehensive LLM evaluation; Text-based molecular processing; Strong performance results","weaknesses":"Limited to DDI prediction; Fine-tuning requirements; No direct repurposing focus","citation":"De Vito, G., Ferrucci, F., & Angelakis, A. (2025). LLMs for Drug-Drug Interaction Prediction: A Comprehensive Comparison. arXiv:2502.06890.","notes":"Challenges H1 (data minimalism), supports H2 (actionability), H3 (cross-drug patterns), H5 (interpretable reasoning).","addedDate":"2025-08-13T05:26:00.000Z"}
{"id":"biokg_survey_2025","title":"Biomedical Knowledge Graph: A Survey of Domains, Tasks, and Real-World Applications","authors":"Lu, Y., Goi, S.Y., Zhao, X., Wang, J.","journal":"arXiv","year":"2025","doi":"2501.11632","url":"https://arxiv.org/abs/2501.11632","keyAssumptions":"Relational databases sufficient; Domain isolation adequate; Static knowledge encoding; Single-purpose design","keyHypotheses":"BKGs enable comprehensive biomedical knowledge integration; Graph representation captures biological complexity","strengths":"Unified framework; Multi-domain coverage; Systematic analysis; Real-world applications","weaknesses":"Challenges data minimalism; Implementation complexity","citation":"Lu, Y., Goi, S.Y., Zhao, X., & Wang, J. (2025). Biomedical Knowledge Graph: A Survey of Domains, Tasks, and Real-World Applications. arXiv:2501.11632.","notes":"Supports H2 (actionability in precision medicine), H3 (cross-disease patterns), challenges H1 (comprehensive integration), supports H5 (interpretable representation).","addedDate":"2025-08-13T05:26:00.000Z"}